{
  "id": 38,
  "title": "Constructive and destructive bounds for the m-machine scheduling\n\t\t\t\t\t\t\t\tproblem",
  "abstract": "The aim of this talk is to present some new results on constructive and destructive bounds for the m-machine scheduling problem. Recently we have characterized mathematically the three main constructive bounds which are the preemptive bound, the energetic bound and the JPPS makespan. These characterizations give insights to their similarities and differences. It explains why these bounds are generally equal in practice. Moreover our characterization of the energetic bound introduced by Erschler, Lopez and Thuriot permits to build a 0(n alpha(n) logn) ( alpha(n) Ackermann coefficient) checker. It is the best one in literature. We have compared it to the checkers of Baptiste Lepape and Nuijten (O(nsquare)) and to the checker of Ouellet and Quimper (O(nlognlogn)). The checker of Baptiste, Lepape and Nuijten is based on an identification of useful intervals and on incremental evaluations of intervals energy. Ouellet and Quimper prove that the energy matrix is a Monge matrix and evaluate the energy of some interval thanks to a pre-calculated data structure based on range trees. We characterize mathematically the useful intervals, then we use the data structures introduced by Ouellet and Quimper and a nice algorithm for partial Monge Matrix. Our checker is also the best one in practice in literature, as it is confirmed by the numerical results we report. Work in collaboration with Abderrahim Sahli, Antoine Jouglet1 and Eric Pinson.",
  "presenter": [
    {
      "name": "Jacques Carlier",
      "affiliation": "Sorbonne Uni",
      "photo": "JacquesCarlier.jpg",
      "link": "https://scholar.google.fr/citations?user=VrUXV3IAAAAJ&hl=en",
      "continent": "Europe"
    }
  ],
  "invitedBy": "Christian Artigues",
  "datePrague": "2023-02-01",
  "keywords": "Scheduling, Cumulative resource, Lower bound, Algorithms, Energetic reasoning",
  "pdf": "/presentations/SchedulingSeminar_JacquesCarlier.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/23_1_Winter/23_2_1%20Jacques%20Carlier%20(Sorbonne%20Uni)%20_%20Constructive%20and%20destructive%20bounds.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/GwJfj3L2A0c",
  "status": "past"
}