{
  "id": 43,
  "title": "Vehicle routing: A focus on heuristic design",
  "abstract": "Local search-based algorithms have tended towards incorporating an ever-increasing number of heuristics for different problem classes, for example all sorts of vehicle routing generalizations. These heuristics range from all-purpose `swap' and `insert' to complicated made-to-measure operators. It has become a challenge to determine the impact of individual components on an algorithm's performance. In contrast to targeting generalizing problem extensions, it may be worthwhile to focus on a problem's core when designing a basic optimization heuristic. This talk introduces a recently published local search operator for vehicle routing problems: SISRs. This heuristic is unique insofar as it seeks to induce `spatial' and `capacity' slack during a ruin phase which may subsequently be exploited in an almost-greedy recreate phase. SISRs emerged after a dedicated attempt towards solving the vehicle routing problem's most basic special case, that is the `capacitated VRP'. SISRs' quality is validated by way of demonstrating its performance across a wide and diverse range of VRP generalizations. This confirms that the basic CVRP ruin & recreate heuristic is also effective when applied to more general vehicle problems, including fleet minimization, without the need to design additional problem-specific components.",
  "presenter": {
    "name": "Greet Vanden Berghe",
    "affiliation": "KU Leuven",
    "photo": "Greet_Vanden_Berghe_2.jpg",
    "link": "https://www.kuleuven.be/wieiswie/nl/person/00053376",
    "continent": "Europe"
  },
  "invitedBy": "Zdeněk Hanzálek",
  "datePrague": "2022-10-12",
  "keywords": "Vehicle routing, Local search operators, Ruin and recreate, Spatial slack, Capacity slack, Fleet minimization",
  "pdf": "/presentations/SchedulingSeminar_GreetVandenBerghe.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/22_3_Fall/22_10_12%20Greet%20Vanden%20Berghe%20(KU%20Leuven)%20_%20Vehicle%20routing_%20A%20focus%20on%20heuristic%20design.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/jPZu44xJfpk",
  "status": "past"
}