{
  "id": 56,
  "title": "Public transit planning and scheduling based on AVL data in\n\t\t\t\t\t\t\t\tChina",
  "abstract": "The public transit operations planning process commonly includes the following activities: network route design, service planning (frequency setting and timetabling) and scheduling (vehicle scheduling, crew scheduling and rostering). However, network route design is generally the only one widely recognized, whilst service planning and scheduling are often ignored in China. This leads to the lack of elaborate timetables and schedules, hence, transit operation is often in disorder with high operating costs. To raise the service level and the utilization of resources, an applied study for three cities in China has been conducted, focusing on the enhancement of the recognition and execution of public transit planning and scheduling. A comprehensive framework of public transit planning is first proposed, which is composed of three traditional Chinese items (i.e. network route design, land use for depots, and deployment of vehicles) and the following newly added items: intelligent public transit system (iPTS) planning, service planning, and scheduling. This is pioneering work in China, during which an iPTS plan is conceived and a new vehicle scheduling approach based on AVL data is developed. Experiments during actual projects show that vehicle schedules with high on-time probability and low cost were compiled, while the essential input parameters such as headways and trip times were set automatically. It is anticipated that the research fruits and practical experiences obtained would be of great benefit in improving service and management levels and resource use in public transport in China and some other developing countries.",
  "presenter": {
    "name": "Yindong Shen",
    "affiliation": "AIA Huazhong Uni",
    "photo": "yindong_shen.jpg",
    "link": "http://english.aia.hust.edu.cn/info/1030/1279.htm",
    "continent": "Asia"
  },
  "invitedBy": "Guohua Wan",
  "datePrague": "2022-02-02",
  "keywords": "Public transit planning, Vehicle scheduling, Timetabling, AVL data, Public transport",
  "pdf": "/presentations/SchedulingSeminar_YindongShen.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/22_1_Winter/22_2_2%20Yindong%20Shen%20(AIA%20Huazhong%20Uni)%20_%20Public%20transit%20planning%20and%20scheduling....mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/nTa1tm-y9c8",
  "status": "past"
}