{
  "id": 61,
  "title": "Train Scheduling: Models, decomposition methods and practice",
  "abstract": "Train scheduling is one of the most critical planning tasks required to run a railway, with most rail operators and managers having large departments devoted to this task. Depending on the time scale, we have two main scheduling problems. At the strategic and tactical levels, the train timetabling problem consists in finding feasible, robust schedules that are usable for months or years into the future. At the operational level, we have the train re-scheduling problem, where one wants to schedule trains in real-time in order to tackle deviations from the original timetable, minimizing delays and knock-on effects. Both problems share a common core-model, which is a job-shop scheduling model with no-wait and blocking constraints. The core problem can be modeled as a disjunctive program. After an illustration of the train scheduling application, I will present a basic MILP formulation for the disjunctive program. It turns out, however, that even small to medium size real-life instances cannot be solved by simply instantiating this formulation and invoking a state-of-the-art MILP solver. Next, therefore, I will go through two recent reformulations, which allow us to significantly increase the size of tractable instances. The first is obtained from the classical Benders' reformulation by strengthening its standard constraints. The second is often referred to as \"Logic Benders' Reformulation\" and exploits a natural, spatial decomposition of the railway network. I will finally show the strong link between these reformulations. I will conclude the talk by presenting a practical application of the described approaches to a traffic management system controlling trains in the greater Oslo region network. The system is currently undergoing a field-test campaign at Oslo control center.",
  "presenter": [
    {
      "name": "Carlo Mannino",
      "affiliation": "SINTEF &amp; Oslo Uni.",
      "photo": "Carlo_Mannino.jpg",
      "link": "https://www.mn.uio.no/math/english/people/aca/carloman/",
      "continent": "Europe"
    }
  ],
  "invitedBy": "Alessandro Agnetis",
  "datePrague": "2021-11-10",
  "keywords": "Train scheduling, Job-shop scheduling, Combinatorial optimization, Integer programming, Decomposition methods",
  "pdf": "/presentations/SchedulingSeminar_CarloMannino.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/21_3_Fall/21_11_10%20Carlo%20Mannino%20_%20Train%20Scheduling_%20Models,%20decomposition...%20_%20Nov%2010,%202021.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/5UUYdg0l-v0",
  "status": "past"
}