{
  "id": 63,
  "title": "The Longest Processing Time Rule for Identical Parallel Machines\n\t\t\t\t\t\t\t\tRevisited",
  "abstract": "We consider the P||Cmax scheduling problem where the goal is to schedule n jobs on m identical parallel machines to minimize makespan. We revisit the famous Longest Processing Time (LPT) rule proposed by Graham in 1969. LPT requires sorting jobs in non-ascending order of processing times and then assigning one job at a time to the machine whose load is smallest so far. We provide new insights into LPT and discuss the approximation ratio of a modification of LPT that improves Graham’s bound. We use linear programming to analyze the approximation ratio of our approach. This performance analysis can be seen as a valid alternative to formal proofs based on analytical derivation. Also, we derive from the proposed approach an O(n log n) time complexity heuristic called SLACK. The heuristic splits the sorted job set in tuples of m consecutive jobs (1,...,m; m+1,...,2m; etc.) and sorts the tuples in non-increasing order of the difference (SLACK) between the largest and smallest job in the tuple. Given this new ordering of the job set, list scheduling is applied. This approach strongly outperforms LPT on benchmark literature instances and is competitive with more involved approaches such as COMBINE and LDM.",
  "presenter": {
    "name": "Federico Della Croce",
    "affiliation": "nominativo",
    "photo": "federico_della_croce.jpg",
    "link": "https://www.digep.polito.it/en/personale/scheda/(nominativo)/federico.dellacroce",
    "continent": "Europe"
  },
  "invitedBy": "Vincent T’kindt",
  "datePrague": "2021-10-13",
  "keywords": "Identical parallel machine scheduling, LPT rule, Linear programming, Approximation",
  "pdf": "SchedulingSeminar_FedericoDellaCroce.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/21_3_Fall/21_10_13%20Federico%20Della%20Croce%20_%20The%20Longest%20Processing%20Time%20Rule%20for...%20_%20Oct%2013,%202021.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/Lp4K6rptmfY",
  "status": "past"
}