{
  "id": 69,
  "title": "On the State of the Art in Proactive/Reactive Project Scheduling",
  "abstract": "The majority of publications in the extensive literature on resource-constrained project scheduling focus on a static deterministic setting for which a so-called baseline schedule is computed prior to project execution. In the real world, however, a project may be subject to considerable uncertainty. During the actual execution of a project, the baseline schedule may indeed suffer from disruptive events, causing the actually realized activity start times to deviate from the predicted baseline start times. This presentation focuses on robust project scheduling, in particular the development of effective and efficient proactive and reactive scheduling procedures. Proactive scheduling aims at generating robust baseline schedules that carry sufficient protection against possible schedule disruptions that may occur during project execution. Reactive scheduling procedures aim at repairing the baseline schedule when the built-in protection fails during the execution of the project. We discuss the fundamentals of state of the art proactive/reactive project scheduling approaches and discuss key directions for future research.",
  "presenter": {
    "name": "Erik Demeulemeester",
    "affiliation": "FEB-KBI, KU Leuven",
    "photo": "erik_demeulemeester.jpg",
    "link": "https://www.kuleuven.be/wieiswie/en/person/00008606",
    "continent": "Europe"
  },
  "invitedBy": {
    "name": "Zdeněk Hanzálek",
    "affiliation": "CTU in Prague",
    "link": "https://rtime.ciirc.cvut.cz/~hanzalek/"
  },
  "datePrague": "2021-05-26",
  "keywords": "Project scheduling, Stochastic activity durations, Proactive/reactive scheduling, Markov decision process",
  "pdf": "SchedulingSeminar_ErikDemeulemeester.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/21_2_Spring/21_5_26%20Erik%20Demeulemeester%20_%20State%20of%20the%20Art%20in%20Proactive_Reactive...%20_%20May%2026,%202021.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/yUfvCgNTe08",
  "status": "past"
}