{
  "title": "Data Science Meets Scheduling",
  "abstract": "The impact of techniques from data science and machine learning on scheduling is investigated. We review a number of recently emerged applications of these techniques that can shed a new light on combinatorial optimization in general. We give concrete examples for scheduling in particular. We distinguish on-line techniques, that is, data science techniques integrated into advanced algorithms, off-line techniques which can be used to improve, select of construct algorithms as well as techniques that consider the problem as living in a space of which the dimensions are set by specific properties of its instances. We give examples of recent results obtained for specific problems in the scheduling domain. Meeting works in two directions. We give an example where a recent theoretical result for a combinatorial optimization problem provides new insights in the structures on which the data science techniques can operate. In this case, the theoretical result allowed to locate a region of hard problem instances in the instance space.",
  "presenter": {
    "name": "Patrick De Causmaecker",
    "affiliation": "KU Leuven",
    "photo": "Patrick_De_Causmaecker.jpg",
    "link": "https://www.kuleuven.be/wieiswie/en/person/00003471",
    "continent": "Europe"
  },
  "invitedBy": {
    "name": "Zdeněk Hanzálek",
    "affiliation": "CTU in Prague",
    "link": "https://rtime.ciirc.cvut.cz/~hanzalek/"
  },
  "datePrague": "2022-05-11",
  "keywords": "Data Science, Machine learning, Combinatorial optimization, Scheduling, Algorithms, Landscape analysis, Automated tuning, Automated construction, Automated selection, Instance hardness",
  "pdf": "SchedulingSeminar_PatrickDeCausmaecker.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/22_2_Spring/22_5_11%20Patrick%20De%20Causmaecker%20(KU%20Leuven)%20_%20Data%20Science%20Meets%20Scheduling.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/6rAPaN80-vY",
  "status": "past"
}