{
  "title": "Dynamic Opponent Choice in Tournaments",
  "abstract": "We propose an alternative design for tournaments that use a preliminary stage, followed by several rounds of single elimination play. Most U.S. major sports, for example, are organized in this way. However, the conventional \"bracket\" design of these tournaments suffers from several deficiencies. First, top ranked players randomly incur unfortunate matchups against other players, which introduces an unnecessary element of luck. Second, as documented in the tournament design literature, various reasonable criteria such as stronger ranked players having a higher probability of winning, are not satisfied. Third, the probability that the top two players meet is not maximized. Fourth, there is the widely observed issue of shirking at the preliminary stage, where a player loses deliberately to obtain an easier path through the tournament. Finally, the use of a conventional fixed bracket fails to allow players to consider information that develops during the tournament, such as injuries to other players. To address all these issues, we allow higher ranked players at the single elimination stage to choose their next opponent at each round. We allow each player's ranking either to remain static, or to improve from beating a higher ranked player. Using data from 1,902 men's professional tennis tournaments from 2001-2016, we demonstrate the reasonableness of the results obtained. We also perform sensitivity analysis for the effect of increasing irregularity in the pairwise win probability matrix on three traditional performance measures. Finally, we show that our opponent choice design reduces shirking, and could have eliminated it in some notorious situations. In summary, compared with the conventional design, the opponent choice design provides higher probabilities that the best player wins and also that the two best players meet, reduces shirking, and performs well for preservation of ranking.",
  "presenter": {
    "name": "Nicholas G. Hall",
    "affiliation": "The Ohio State Uni",
    "photo": "nicholas_hall.jpg",
    "link": "",
    "continent": "America"
  },
  "invitedBy": {
    "name": "Mario Vanhoucke",
    "affiliation": "Ghent University",
    "link": "https://www.or-as.be"
  },
  "datePrague": "2021-09-14",
  "keywords": "Multiple round sports tournament, Choice of opponent, Performance criteria, Professional tennis",
  "pdf": "presentations/SchedulingSeminar_NicholasHall.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/21_3_Fall/21_9_14%20Nicholas%20G.%20Hall%20_%20Dynamic%20Opponent%20Choice%20in%20Tournaments%20_%20Sep%2014,%202021.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/h_wXHo83in0",
  "status": "past"
}