{
  "title": "Enhancing project resilience: a risk-averse approach to payment\n\t\t\t\t\t\t\t\tdelays",
  "abstract": "The onset of the pandemic and the conflict in Europe have disrupted our society, supply chains, and economies. The effects of these global shocks are evident in every type of project - whether related to the energy transition, the renewal of transport infrastructure, or the construction industry- impacted by the highest rates of inflation in more than 30 years and by a significant cash flow crisis. In this complex landscape, delays in payments have become a common risk factor for projects, since they create a time lag between the expenses incurred by the contractor and the progress payments received from the client. The challenges associated with obtaining continuous project finances often place undue financial strain on contractors that may seek loans from financial institutions to maintain their daily operations. These loans must be returned with interest, increasing financing costs, and considerably lowering the Net Present Value. In this talk, we delve into cash flow and project scheduling strategies to mitigate late payment impacts and enhancing project resilience, presenting a distributionally robust risk-averse model that minimizes the financing cost by accurately estimating the amount and timing of the expenses and revenues throughout the project life cycle and foreseeing possible cost overruns and cash flow fluctuations. Joint work with Oncu Hazir",
  "presenter": {
    "name": "Maria Elena Bruni",
    "affiliation": "Uni of Calabria",
    "photo": "Maria_Elena.jpg",
    "link": "https://www.unical.it/storage/teachers/gAAAAABi2D-mEiJ-DC2koDLqpcRWlGK5Iqt7PXrVZZFzO6-vUCbdNHpud2f3YD2nN-FriRbt-aqfOBGausOLqfuhcsrRp-hJSg==/?lang=en",
    "continent": "Europe"
  },
  "invitedBy": {
    "name": "Zdeněk Hanzálek",
    "affiliation": "CTU in Prague",
    "link": "https://rtime.ciirc.cvut.cz/~hanzalek/"
  },
  "datePrague": "2023-11-29",
  "keywords": "Scheduling under uncertainty and risk, Payment delays, Net Present Value, Cash flow analysis",
  "pdf": "SchedulingSeminar_MariaElenaBruni.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/23_3_Fall/23_11_29%20Maria%20Elena%20Bruni%20(Calabria)%20_%20Enhancing%20project%20resilience_%20a%20risk-averse....mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/Zvn9YemZp60?si=d6y-quI7eKj1Hyiu",
  "status": "past"
}