{
  "title": "Mixed-integer linear programming for project scheduling with\n\t\t\t\t\t\t\t\tresource-unit related constraints",
  "abstract": "The widely discussed Resource-Constrained Project Scheduling Problem (RCPSP) consists in devising a schedule for the execution of the project activities such that (a) the project duration is minimized, (b) the completion-start precedence between given pairs of activities is respected, and (c) at no time does the total demand of the in-progress activities exceed the available capacity of the various resource types required for the execution of the activities. In the literature, different formulations of the RCPSP have been presented as binary or mixed-binary linear optimization problems; according to the time representation, the two groups of discrete-time and continuous-time formulations can be distinguished. In many applications, resource types represent pools of equipment units or teams of people with specific skills. In this talk, we consider two novel variants of the RCPSP in which additional constraints related to the individual units of the various resource types have to be considered. In the first variant, the execution of the project is distributed across multiple sites, i.e., for the execution of each activity, a particular site must be selected; moreover, while some resource units are available only at a particular site, other resource units can be moved between sites, requiring some transportation time. In the second variant, the workload should be balanced among the individual units of each resource type. For both variants, we present a continuous-time assignment-based formulation as a mixed-binary linear optimization problem.",
  "presenter": {
    "name": "Norbert Trautmann",
    "affiliation": "University of Bern",
    "photo": "Norbert_Trautmann.jpg",
    "link": "http://www.pqm.unibe.ch",
    "continent": "Europe"
  },
  "invitedBy": {
    "name": "Zdeněk Hanzálek",
    "affiliation": "CTU in Prague",
    "link": "https://rtime.ciirc.cvut.cz/~hanzalek/"
  },
  "datePrague": "2024-12-05",
  "keywords": "Project scheduling, Multi-site projects, Workload balancing, Mixed-integer linear programming",
  "pdf": "SchedulingSeminar_NorbertTrautmann.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/24_3_Fall/24_12_05%20Norbert%20Trautmann%20(University%20of%20Bern)%20_%20MILP%20for%20project%20scheduling.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/1G8aruF9ZB0?si=EBJFbxZS70VgwrmY",
  "status": "past"
}