{
  "title": "On Polyhedral Approaches to Scheduling Problems",
  "abstract": "The formulation of scheduling problems as mathematical optimization problems is a useful step in deriving exact solutions, or approximate solutions with performance guarantees. We give a brief overview of polyhedral approaches, which aim to apply the power of linear and mixed-integer optimization to certain classes of scheduling problems, in particular those with min-sum type of objectives such as to minimize weighted sums of completion dates. The choice of decision variables is the prime determinant of such formulations. Constraints, such as facet inducing inequalities for corresponding polyhedra, are often needed, in addition to those just required for the validity of the initial formulation, in order to derive useful dual bounds and structural insights. Alternative formulations are based on various types of decision variables, such as: start date and completion date variables, that simply specify when a task is performed; linear ordering variables, that prescribe the relative order of pairs of tasks; traveling salesman variables, which capture immediate succession of tasks and changeovers; assignment and positional date variables, which specify the assignment of tasks to machine or to positions; and time-indexed variables which rely on a discretization of the planning horizon, in particular machine switch-on and switch-off variables in production planning and unit commitment in power generation. We point out relationship between various models, and emphasize the role of supermodular polyhedra and greedy algorithms.",
  "presenter": {
    "name": "Maurice Queyranne",
    "affiliation": "Sauder School, UBC",
    "photo": "Maurice_Queyranne.jpg",
    "link": "https://www.sauder.ubc.ca/people/maurice-queyranne",
    "continent": "America"
  },
  "invitedBy": {
    "name": "Michael Pinedo",
    "affiliation": "New York Uni",
    "link": "https://www.stern.nyu.edu/faculty/bio/michael-pinedo"
  },
  "datePrague": "2022-06-22",
  "keywords": "Scheduling, Polyhedra, Formulations",
  "pdf": "SchedulingSeminar_MauriceQueyranne.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/22_2_Spring/22_6_22%20Maurice%20Queyranne%20(Sauder%20School,%20UBC)%20_%20On%20Polyhedral%20Approaches%20to%20Sched....mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/Pi_aBHm10-c",
  "status": "past"
}