{
  "title": "Optimal solving of scheduling problems on D-Wave quantum machines",
  "abstract": "The main disadvantage of calculations on real quantum computers is their non-determinism. For optimization problems, it is possible to get surprisingly good results using Quantum Annealing approach, but without a guarantee of the optimality of the result. Simply put, the quantum machine has not found anything better. In the presentation an approach that provides such a guarantee of optimality is proposed. A solution that is optimal in the strict mathematical sense is generated, without probabilistic considerations. For this purpose, a D-Wave quantum machine is used working as a sampler implementing quantum annealing -- an approach considered as a hardware metaheuristic -- to obtain upper and lower bounds on the value of the objective function of the problem under consideration. Then the mechanism of a Branch and Bound scheme is used and controlled by quantum annealing, which allows us to obtain very quickly -- in constant time for considered instances -- the boundaries of the considered subproblems. The whole idea is an alternately combination of calculations realized on QPU and CPU, allowing us to generate optimal solutions to the NP-hard problems of task scheduling on a single machine with a total weighted tardiness as well as with total number of tardy jobs criteria. The main result is the formulation of the lower bound in a \"language\" (i.e. mathematical model) understandable by a quantum machine.",
  "presenter": {
    "name": "Wojciech Božejko",
    "affiliation": "Poli Wrocławska",
    "photo": "Wojciech_Bozejko.jpg",
    "link": "http://staff.iiar.pwr.wroc.pl/wojciech.bozejko/",
    "continent": "Europe"
  },
  "invitedBy": {
    "name": "Přemysl Šůcha",
    "affiliation": "CTU in Prague",
    "link": "http://people.ciirc.cvut.cz/~suchap/"
  },
  "datePrague": "2023-04-12",
  "keywords": "Scheduling, Quantum Annealing, Single machine, Exact algorithm",
  "pdf": "SchedulingSeminar_WojciechBozejko.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/23_2_Spring/23_4_12%20Wojciech%20Bozejko%20(Poli Wroclawska)%20_%20Opt.%20sched.%20problem%20solving%20on%20D-Wave.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/EuapHFRt-7k",
  "status": "past"
}