{
  "id": 1,
  "title": "Outpatient Appointment Scheduling with Waiting Time Limits",
  "abstract": "This paper studies outpatient appointment scheduling with waiting time limits, in the presence of uncertain service times, patient no-shows and unpunctual arrivals. To tackle the problem of excessively long waiting times, policymakers may impose a waiting time limit. The introduction of waiting time limits increases the complexity of model formulation by significantly increasing the number of problem scenarios. To address this challenge, we introduce the concept of virtual waiting time, representing the additional waiting time that a patient would have to incur to see the doctor beyond the imposed waiting time limit. Using this construct, we are able to unify the modeling of system dynamics of all different scenarios into one stochastic program. We develop a tailored integer L-shaped method to solve this model and test its effectiveness against two benchmarks. Specifically, the subproblem is a mixed integer nonlinear program with good properties, which allow us to deduce its optimal value without using optimization solver. We find that the presence of waiting time limits increases the job allowance between two adjacent patients, and the optimal schedule does not necessarily exhibit the well-known dome-shaped pattern. We also find that waiting time limits help reduce variation in patient waiting times across different positions in the schedule, thereby enhancing fairness in the schedule. Furthermore, our results indicate that in the presence of waiting time limits, the total cost of the system is minimized when patients tend to arrive slightly late on average. Finally, we find that when a social planner sets the limit, the clinic has incentives to misreport its true cost of serving each diverted patient, and an additional fine on top of the time limits helps improve social welfare.",
  "presenter": {
    "name": "Rachel R. Chen",
    "affiliation": "UC Davis",
    "photo": "RachelChen.jpg",
    "link": "https://gsm.ucdavis.edu/faculty/rachel-chen",
    "continent": "America"
  },
  "invitedBy": {
    "name": "Michael Pinedo",
    "affiliation": "UC Davis",
    "link": "https://www.stern.nyu.edu/faculty/bio/michael-pinedo"
  },
  "datePrague": "2025-11-12",
  "keywords": "Appointment scheduling, Waiting time limits, Uncertain service times",
  "pdf": "SchedulingSeminar_RachelChen.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/25_3_Fall/%5bScheduling%20seminar%5d%20Rachel%20R.%20Chen%20(UC%20Davis)%20_%20Outpatient%20Appointment%20Scheduling.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/DK2kYNejmek?si=qZ1bAJvF7uVOWZnN",
  "status": "past"
}