{
  "title": "Synchronous DataFlow: A survival guide",
  "abstract": "Synchronous Dataflow (SDF in short) were introduced in 1987 by Lee and Messerschmitt to model data exchanges in embedded systems. A SDF is usually defined by a directed graph, where each node is associated to a task that may be executed infinetly often. Each arc represents a buffer between two tasks. Moreover, the number of data samples produced or consumed by each task on each execution is specified a priori. Nowadays, SDF are considered by several scientific communities. It allows for example to model the exchanges for the design of Digital Signal Processings, or in real-time applications to run on a complex architecture. The purpose of this talk is to present a set of mathematical results developed on SDF, and to show how to use them to solve concrete problems posed by their users. We will also do the link with classical cyclic scheduling problems by demonstrating that the buffers can be associated to usual precedence constraints between successive task executions. We will conclude by some challenging open questions.",
  "presenter": {
    "name": "Alix Munier Kordon",
    "affiliation": "Sorbonne U., LIP6",
    "photo": "Alix_Munier_Kordon.jpg",
    "link": "https://www.lip6.fr/actualite/personnes-fiche.php?ident=P653",
    "continent": "Europe"
  },
  "invitedBy": {
    "name": "Claire Hanen",
    "affiliation": "Sorbonne Uni",
    "link": "https://ufr-segmi.parisnanterre.fr/organisation-et-contacts/espace-reserve-enseignants/site-des-enseignants/les-enseignants-de-segmi/hanen-claire/hanen-claire-93518.kjsp"
  },
  "datePrague": "2022-09-28",
  "keywords": "Synchronous DataFlow, Precedence constraints, Normalization, Liveness, Throughput evaluation",
  "pdf": "SchedulingSeminar_AlixMunierKordon.pdf",
  "video": "https://scheduling-seminar.iid.ciirc.cvut.cz/videos/22_3_Fall/22_9_28%20Alix%20Munier%20Kordon%20(Sorbonne%20U.,%20LIP6)%20_%20Synchronous%20DataFlow_%20A%20survival%20guide.mp4",
  "youtubeEmbed": "https://www.youtube.com/embed/V0LUV5j180E",
  "status": "past"
}